import 'object.dart';

double factor = 1;
String tabName = '易方陣';
List<PopImage> popImages = [
  // ### 1.
//  PopImage(203, 405, 200, 260, 'reference/1-1.jpg', '剛健自強', ''),
  PopImage(483, 405, 200, 260, 'reference/1-2.jpg', '果斷決定', '天氣轉暖，春雷震響，蟄伏在泥土裏的各種冬眠動物蘇醒過來開始活動，大部分地區進入春耕'),
  PopImage(762, 405, 200, 260, 'reference/1-3.jpg', '大有可容', '溫暖而舒適。樹木抽出嫩綠的枝葉，百花爭相盛開，雖然春雷驚蟄已過，但天氣仍然多變，偶爾會有驚蟄時的驚雷驟雨。'),
  PopImage(1040, 405, 200, 260, 'reference/1-4.jpg', '大壯震動', '這一天南北兩半球晝夜相等。大部分地區越冬作物進入春季生長階段'),
  PopImage(1319, 405, 200, 260, 'reference/1-5.jpg', '小處修補', '陽光明媚、舒適宜人，充滿花和樹葉的清新氣息。樹木已經吐綠，鳥語花香，絢麗的花朵在陽光下綻放，春意盎然。'),
  PopImage(1597, 405, 200, 260, 'reference/1-6.jpg', '需安以待', '樹木已經長出嫩綠的嫩葉，百花齊放，絢爛多彩。遠處的山巒蒼翠欲滴，隱約可見一片片茶園、果園，綠草如茵，山花爛漫。'),
  PopImage(1875, 405, 200, 260, 'reference/1-7.jpg', '大大整備', '天氣晴朗溫暖，草木始發新枝芽，萬物開始生長，農民忙於春耕春種。人們在門口插上楊柳條，到郊外踏青，以及祭掃墳墓。'),
//  PopImage(2150, 405, 200, 260, 'reference/1-8.jpg', '合泰安順', ''),

  // ### 2.
  PopImage(203, 780, 200, 260, 'reference/2-1.jpg', '行動合理', '天氣較暖，雨量增加，是北方春耕作物播種的好季節，因為有雨水滋潤大地。'),
  PopImage(2150, 780, 200, 260, 'reference/2-8.jpg', '面對問題', '大麥、冬小麥等夏收作物，已經結果、籽粒飽滿，但尚未成熟。'),

  // ### 3.
  PopImage(203, 1150, 200, 260, 'reference/3-1.jpg', '共同合作', '天氣已冷，開始有霜凍。南方仍可秋收秋種'),
  PopImage(2150, 1150, 200, 260, 'reference/3-8.jpg', '忍受逼迫', '正值初伏前後，天氣很熱但尚未酷熱，忙於夏秋作物的工作。'),

  // ### 4.
  PopImage(203, 1520, 200, 260, 'reference/4-1.jpg', '不妄無災', '正值中伏前後，一年最炎熱時期，喜溫作物迅速生長；雨水甚多。'),
  PopImage(2150, 1520, 200, 260, 'reference/4-8.jpg', '一陽復始', '氣候變涼的象徵，表示暑天終止，夏季火熱已經到了盡頭。'),

  // ### 5.
  PopImage(203, 1890, 200, 260, 'reference/5-1.jpg', '陰制於陽', '天氣轉涼，地面水汽結露。'),
  PopImage(2150, 1890, 200, 260, 'reference/5-8.jpg', '隨機浮升', '天氣轉涼，露水日多。'),

  // ### 6.
  PopImage(203, 2260, 200, 260, 'reference/6-1.jpg', '易起爭訟', '小麥等有芒作物成熟，宜開始秋播，如晚穀、黍、稷等。長江中下游地區將進入黃梅季節，連綿陰雨'),
  PopImage(2150, 2260, 200, 260, 'reference/6-8.jpg', '興師聚眾', '氣溫下降，黃河流域開始降雪；北方已進入封凍季節。'),

  // ### 7.
  PopImage(203, 2630, 200, 260, 'reference/7-1.jpg', '退縮不前', '黃河流域一帶漸有積雪；而北方已是萬里冰封。'),
  PopImage(2150, 2630, 200, 260, 'reference/7-8.jpg', '謙沖寡欲', '開始進入寒冷季節。冷氣積久而寒，大部分地區進入嚴寒時期。'),

  // ### 8.
  PopImage(483, 3000, 200, 260, 'reference/8-2.jpg', '萃聚人氣', '天氣寒冷到了極點，是一年中最冷的時候。'),
  PopImage(762, 3000, 200, 260, 'reference/8-3.jpg', '柔進上行', '大地上依然被一層厚厚的雪覆蓋著，樹木、房屋、街道彷彿都披上了一層銀裝。'),
  PopImage(1040, 3000, 200, 260, 'reference/8-4.jpg', '順勢豫備', '開始進入春天，萬物復蘇。'),
  PopImage(1319, 3000, 200, 260, 'reference/8-5.jpg', '多方觀察', '冰雪逐漸消融，土地逐漸回暖。樹木開始抽出嫩綠的新芽，花草漸漸吐露。'),
  PopImage(1597, 3000, 200, 260, 'reference/8-6.jpg', '依比靠近', '春風遍吹，天氣漸暖，冰雪溶化，空氣濕潤，雨水增多。'),
  PopImage(1875, 3000, 200, 260, 'reference/8-7.jpg', '日漸剝落', '仍有雨水降落，田野里的農民們趁著雨水停歇的間隙犁地播種，為春耕做準備。他們在田間來回奔波，播種農作物。'),
];
